#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.cloud_key: Refreshing state... [id=3c5e9d12a9bb0c2ce02ec4aceef42a50ecdfee45]
aws_key_pair.cloud_key: Refreshing state... [id=cloud_key]
data.aws_ami.rhel: Reading...
aws_vpc.aap_vpc: Refreshing state... [id=vpc-07193904d0c8af3d3]
data.aws_ami.rhel: Read complete after 0s [id=ami-0aa5623207b6e6049]
aws_internet_gateway.aap_igw: Refreshing state... [id=igw-0937564cbc18d8b1d]
aws_subnet.aap_subnet: Refreshing state... [id=subnet-0031afc7e8ee3cf90]
aws_security_group.aap_security_group: Refreshing state... [id=sg-0065749777376631d]
aws_lb_target_group.aap_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:324037292257:targetgroup/aap-tg/b05f05512b5196aa]
aws_route_table.aap_pub_igw: Refreshing state... [id=rtb-0e60c146cafb99e99]
aws_lb.aap_nlb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:324037292257:loadbalancer/net/aap-nlb/7b3f12b1426f8b75]
aws_security_group_rule.redis_ingress_access: Refreshing state... [id=sgrule-837772598]
aws_security_group_rule.grpc_ingress_access: Refreshing state... [id=sgrule-189889194]
aws_security_group_rule.postgresql_ingress_access: Refreshing state... [id=sgrule-820600024]
aws_security_group_rule.secure_ingress_access: Refreshing state... [id=sgrule-2092985729]
aws_security_group_rule.https_ingress_access: Refreshing state... [id=sgrule-3233154944]
aws_security_group_rule.egress_access: Refreshing state... [id=sgrule-3278934366]
aws_security_group_rule.ssh_ingress_access: Refreshing state... [id=sgrule-3788315192]
aws_security_group_rule.http_ingress_access: Refreshing state... [id=sgrule-1464289165]
aws_route_table_association.aap_rt_subnet_public: Refreshing state... [id=rtbassoc-09c514965250af10b]
aws_lb_listener.http_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:324037292257:listener/net/aap-nlb/7b3f12b1426f8b75/c01a80e98f2ea307]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ansible_host.aap_instance[0] will be created
  + resource "ansible_host" "aap_instance" {
      + groups    = [
          + "gateway",
        ]
      + id        = (known after apply)
      + name      = (known after apply)
      + variables = {
          + "ansible_python_interpreter"   = "/usr/bin/python3"
          + "ansible_ssh_private_key_file" = "~/.ssh/id_rsa"
          + "ansible_user"                 = "ec2-user"
        }
    }

  # ansible_host.aap_instance[1] will be created
  + resource "ansible_host" "aap_instance" {
      + groups    = [
          + "gateway",
        ]
      + id        = (known after apply)
      + name      = (known after apply)
      + variables = {
          + "ansible_python_interpreter"   = "/usr/bin/python3"
          + "ansible_ssh_private_key_file" = "~/.ssh/id_rsa"
          + "ansible_user"                 = "ec2-user"
        }
    }

  # aws_instance.aap_instance[0] will be created
  + resource "aws_instance" "aap_instance" {
      + ami                                  = "ami-0aa5623207b6e6049"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "cloud_key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0031afc7e8ee3cf90"
      + tags                                 = {
          + "Name"      = "aap-controller-0"
          + "Terraform" = "true"
        }
      + tags_all                             = {
          + "Name"      = "aap-controller-0"
          + "Terraform" = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "2a3476247926c2383053ca81ff1d0d761f1d115e"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0065749777376631d",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp3"
        }
    }

  # aws_instance.aap_instance[1] will be created
  + resource "aws_instance" "aap_instance" {
      + ami                                  = "ami-0aa5623207b6e6049"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "cloud_key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0031afc7e8ee3cf90"
      + tags                                 = {
          + "Name"      = "aap-controller-1"
          + "Terraform" = "true"
        }
      + tags_all                             = {
          + "Name"      = "aap-controller-1"
          + "Terraform" = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "2a3476247926c2383053ca81ff1d0d761f1d115e"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0065749777376631d",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp3"
        }
    }

  # aws_lb_target_group_attachment.aap_instance_attachment[0] will be created
  + resource "aws_lb_target_group_attachment" "aap_instance_attachment" {
      + id               = (known after apply)
      + port             = 443
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:324037292257:targetgroup/aap-tg/b05f05512b5196aa"
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.aap_instance_attachment[1] will be created
  + resource "aws_lb_target_group_attachment" "aap_instance_attachment" {
      + id               = (known after apply)
      + port             = 443
      + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:324037292257:targetgroup/aap-tg/b05f05512b5196aa"
      + target_id        = (known after apply)
    }

  # null_resource.hostname_update will be created
  + resource "null_resource" "hostname_update" {
      + id = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id = [
      + (known after apply),
      + (known after apply),
    ]
  + public_fqdn = [
      + (known after apply),
      + (known after apply),
    ]
  + public_ip   = [
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @r3dact3d, Action: `pull_request`*